Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияИМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	 Объект.Продукция.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПродукцияПриИзменении(Элемент)
	
	Элементы.Продукция.ТекущиеДанные.Цена = РаботаСоСправочниками.ЦенаНаПродукцию(Объект.Дата, Объект.Клиент, Элементы.Продукция.ТекущиеДанные.Продукция);
	Если  Элементы.Продукция.ТекущиеДанные.Количество = 0 Тогда
		 Элементы.Продукция.ТекущиеДанные.Количество = 1;
	КонецЕсли;
	Элементы.Продукция.ТекущиеДанные.Сумма = Элементы.Продукция.ТекущиеДанные.Количество * Элементы.Продукция.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	строка = Элементы.Продукция.ТекущиеДанные;
	строка.Сумма = строка.Количество * строка.Цена
КонецПроцедуры
